src/xiaofang.Dispatch-Entity-Request.res.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns="urn:xiaofang">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:EntityData>
   <id>
    <id>0</id>
    <name></name>
    <entity-type>UNIT</entity-type>
    <parentid>0</parentid>
   </id>
   <unit>
    <base>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </base>
    <include-members>false</include-members>
    <members>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </members>
   </unit>
   <accout>
    <base>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </base>
    <account-type>Dispatcher</account-type>
    <number></number>
    <short-number></short-number>
    <password></password>
    <service-status>AccountStop</service-status>
    <priority>0</priority>
    <call-privilege>CallForbid</call-privilege>
    <token-privilege>TokenForbid</token-privilege>
    <gps-report-mode>GpsManualPull</gps-report-mode>
    <ttl>0</ttl>
    <status>OffLine</status>
    <sip-status>OffLine</sip-status>
    <address>
     <ip></ip>
     <port>0</port>
    </address>
   </accout>
   <user>
    <base>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </base>
    <password></password>
    <user-type>Admin</user-type>
    <account>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </account>
    <status>OffLine</status>
    <address>
     <ip></ip>
     <port>0</port>
    </address>
   </user>
   <group>
    <base>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </base>
    <owner>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </owner>
    <number></number>
    <short-number></short-number>
    <sealed>false</sealed>
    <include-participants>false</include-participants>
    <participants>
     <id>0</id>
     <group>
      <id>0</id>
      <name></name>
      <entity-type>UNIT</entity-type>
      <parentid>0</parentid>
     </group>
     <account>
      <id>0</id>
      <name></name>
      <entity-type>UNIT</entity-type>
      <parentid>0</parentid>
     </account>
     <priority>0</priority>
     <call-privilege>CallForbid</call-privilege>
     <toke-privilege>TokenForbid</toke-privilege>
     <status>IDLE</status>
     <sync-added>false</sync-added>
    </participants>
    <record-type>DontRecord</record-type>
    <recorder>
     <id>0</id>
     <group>
      <id>0</id>
      <name></name>
      <entity-type>UNIT</entity-type>
      <parentid>0</parentid>
     </group>
     <account>
      <id>0</id>
      <name></name>
      <entity-type>UNIT</entity-type>
      <parentid>0</parentid>
     </account>
     <priority>0</priority>
     <call-privilege>CallForbid</call-privilege>
     <toke-privilege>TokenForbid</toke-privilege>
     <status>IDLE</status>
     <sync-added>false</sync-added>
    </recorder>
    <record-status>RecordStop</record-status>
   </group>
   <alert>
    <base>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </base>
    <group>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </group>
    <describe></describe>
    <level>Exigency</level>
    <alram-time></alram-time>
    <use-cars>0</use-cars>
    <create-time></create-time>
    <status>AlertActive</status>
   </alert>
   <gateway>
    <base>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </base>
    <address>
     <ip></ip>
     <port>0</port>
    </address>
    <include-allocate-counts>false</include-allocate-counts>
    <allocate-counts>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </allocate-counts>
    <include-active-counts>false</include-active-counts>
    <active-counts>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </active-counts>
    <status>OffLine</status>
   </gateway>
   <organization>
    <base>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </base>
    <include-members>false</include-members>
    <members>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </members>
   </organization>
  </ns:EntityData>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
